{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Connect neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "#connect neo4j with RNeo4j\n",
    "library(RNeo4j)\n",
    "\n",
    "graph = startGraph(\"http://localhost:7474/db/data/\", username=\"neo4j\", password=\"xiaowei\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Get all gene names in GREG"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Make a function to get all gene names."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Your code contains a unicode char which cannot be displayed in your\n",
      "current locale and R will silently convert it to an escaped form when the\n",
      "R kernel executes this code. This can lead to subtle errors if you use\n",
      "such chars to do comparisons. For more information, please see\n",
      "https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows"
     ]
    }
   ],
   "source": [
    "#----------------------------------------------------------------------------------------------------------------------\n",
    "#----------------------------------------------------------------------------------------------------------------------\n",
    "#--------------------#获取所有基因\n",
    "#----------------------------------------------------------------------\n",
    "#---建一个函数来获取数据库里面所有gene names\n",
    "#该基因gene name 存在于 node的Details属性上\n",
    "#返回数据框，包含基因名称，节点的id号和节点label， 节点Name\n",
    "\n",
    "getAllGeneName = function(){\n",
    "  #连接neo4j数据库\n",
    "  \n",
    "  library(RNeo4j)\n",
    "  graph = startGraph(\"http://localhost:7474/db/data/\", username=\"neo4j\", password=\"xiaowei\")\n",
    "  \n",
    "  #cypher语言查询\n",
    "  query = \"\n",
    "        //get all nodes which had `Details` property\n",
    "        //查找有Details属性的节点\n",
    "      MATCH (n)\n",
    "      where exists(n.Details)\n",
    "\n",
    "        //split the Details information\n",
    "        //利用split函数拆分Details属性值\n",
    "      with split(n.Details, ';') AS Details,id(n) AS NodeID, labels(n) AS NodeLabel, n.Name AS NodeNames\n",
    "\n",
    "        //change the list format\n",
    "        //利用UNWIND将Details列表换成表格形式\n",
    "      UNWIND Details AS details\n",
    "      with details, NodeID, NodeLabel, NodeNames\n",
    "\n",
    "        //filter those Details information which includes gene_name\n",
    "        // 筛选出含有gene_name的信息\n",
    "      where details contains 'gene_name'\n",
    "      with details as genes, NodeID, NodeLabel, NodeNames\n",
    "\n",
    "        // use `substring` to get real gene names\n",
    "        // 然后利用substring函数截取基因名称， 返回基因名称，节点的id号和节点label\n",
    "      return substring(genes,11) as geneName, NodeID, NodeLabel, NodeNames\n",
    "  \"\n",
    "  #进行查询\n",
    "  allGenes <- RNeo4j::cypher(graph, query) \n",
    "  \n",
    "  #返回查询结果\n",
    "  return(allGenes)\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## a data frame of  all gene in chromosome"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "#-----------all gene in chromosome---------------------\n",
    "AllgeneName <- getAllGeneName()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "AllgeneName <- unique(AllgeneName)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "<caption>A data.frame: 6 × 4</caption>\n",
       "<thead>\n",
       "\t<tr><th scope=col>geneName</th><th scope=col>NodeID</th><th scope=col>NodeLabel</th><th scope=col>NodeNames</th></tr>\n",
       "\t<tr><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;int&gt;</th><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;chr&gt;</th></tr>\n",
       "</thead>\n",
       "<tbody>\n",
       "\t<tr><td>DDX11L1     </td><td>0</td><td>chr1</td><td>Bin1</td></tr>\n",
       "\t<tr><td>WASH7P      </td><td>0</td><td>chr1</td><td>Bin1</td></tr>\n",
       "\t<tr><td>MIR6859-1   </td><td>0</td><td>chr1</td><td>Bin1</td></tr>\n",
       "\t<tr><td>RP11-34P13.3</td><td>0</td><td>chr1</td><td>Bin1</td></tr>\n",
       "\t<tr><td>MIR1302-2   </td><td>0</td><td>chr1</td><td>Bin1</td></tr>\n",
       "\t<tr><td>FAM138A     </td><td>0</td><td>chr1</td><td>Bin1</td></tr>\n",
       "</tbody>\n",
       "</table>\n"
      ],
      "text/latex": [
       "A data.frame: 6 × 4\n",
       "\\begin{tabular}{r|llll}\n",
       " geneName & NodeID & NodeLabel & NodeNames\\\\\n",
       " <chr> & <int> & <chr> & <chr>\\\\\n",
       "\\hline\n",
       "\t DDX11L1      & 0 & chr1 & Bin1\\\\\n",
       "\t WASH7P       & 0 & chr1 & Bin1\\\\\n",
       "\t MIR6859-1    & 0 & chr1 & Bin1\\\\\n",
       "\t RP11-34P13.3 & 0 & chr1 & Bin1\\\\\n",
       "\t MIR1302-2    & 0 & chr1 & Bin1\\\\\n",
       "\t FAM138A      & 0 & chr1 & Bin1\\\\\n",
       "\\end{tabular}\n"
      ],
      "text/markdown": [
       "\n",
       "A data.frame: 6 × 4\n",
       "\n",
       "| geneName &lt;chr&gt; | NodeID &lt;int&gt; | NodeLabel &lt;chr&gt; | NodeNames &lt;chr&gt; |\n",
       "|---|---|---|---|\n",
       "| DDX11L1      | 0 | chr1 | Bin1 |\n",
       "| WASH7P       | 0 | chr1 | Bin1 |\n",
       "| MIR6859-1    | 0 | chr1 | Bin1 |\n",
       "| RP11-34P13.3 | 0 | chr1 | Bin1 |\n",
       "| MIR1302-2    | 0 | chr1 | Bin1 |\n",
       "| FAM138A      | 0 | chr1 | Bin1 |\n",
       "\n"
      ],
      "text/plain": [
       "  geneName     NodeID NodeLabel NodeNames\n",
       "1 DDX11L1      0      chr1      Bin1     \n",
       "2 WASH7P       0      chr1      Bin1     \n",
       "3 MIR6859-1    0      chr1      Bin1     \n",
       "4 RP11-34P13.3 0      chr1      Bin1     \n",
       "5 MIR1302-2    0      chr1      Bin1     \n",
       "6 FAM138A      0      chr1      Bin1     "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "head(AllgeneName)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>67300</li>\n",
       "\t<li>4</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 67300\n",
       "\\item 4\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 67300\n",
       "2. 4\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       "[1] 67300     4"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "dim(AllgeneName)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "GREG have 67418 genes names. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## a data frame of  all TF "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "#-----------TF----------------------\n",
    "query = \"MATCH (n:TF)\n",
    "        RETURN n.Name AS geneName, id(n) AS NodeID, labels(n) AS NodeLabel, n.Name AS NodeNames\"\n",
    "TFName =unique( cypher(graph, query) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "<caption>A data.frame: 6 × 4</caption>\n",
       "<thead>\n",
       "\t<tr><th scope=col>geneName</th><th scope=col>NodeID</th><th scope=col>NodeLabel</th><th scope=col>NodeNames</th></tr>\n",
       "\t<tr><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;int&gt;</th><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;chr&gt;</th></tr>\n",
       "</thead>\n",
       "<tbody>\n",
       "\t<tr><td>AFF4  </td><td>15448</td><td>TF</td><td>AFF4  </td></tr>\n",
       "\t<tr><td>AHR   </td><td>15449</td><td>TF</td><td>AHR   </td></tr>\n",
       "\t<tr><td>ARID3A</td><td>15450</td><td>TF</td><td>ARID3A</td></tr>\n",
       "\t<tr><td>ARNT  </td><td>15451</td><td>TF</td><td>ARNT  </td></tr>\n",
       "\t<tr><td>ARRB1 </td><td>15452</td><td>TF</td><td>ARRB1 </td></tr>\n",
       "\t<tr><td>ATF1  </td><td>15453</td><td>TF</td><td>ATF1  </td></tr>\n",
       "</tbody>\n",
       "</table>\n"
      ],
      "text/latex": [
       "A data.frame: 6 × 4\n",
       "\\begin{tabular}{r|llll}\n",
       " geneName & NodeID & NodeLabel & NodeNames\\\\\n",
       " <chr> & <int> & <chr> & <chr>\\\\\n",
       "\\hline\n",
       "\t AFF4   & 15448 & TF & AFF4  \\\\\n",
       "\t AHR    & 15449 & TF & AHR   \\\\\n",
       "\t ARID3A & 15450 & TF & ARID3A\\\\\n",
       "\t ARNT   & 15451 & TF & ARNT  \\\\\n",
       "\t ARRB1  & 15452 & TF & ARRB1 \\\\\n",
       "\t ATF1   & 15453 & TF & ATF1  \\\\\n",
       "\\end{tabular}\n"
      ],
      "text/markdown": [
       "\n",
       "A data.frame: 6 × 4\n",
       "\n",
       "| geneName &lt;chr&gt; | NodeID &lt;int&gt; | NodeLabel &lt;chr&gt; | NodeNames &lt;chr&gt; |\n",
       "|---|---|---|---|\n",
       "| AFF4   | 15448 | TF | AFF4   |\n",
       "| AHR    | 15449 | TF | AHR    |\n",
       "| ARID3A | 15450 | TF | ARID3A |\n",
       "| ARNT   | 15451 | TF | ARNT   |\n",
       "| ARRB1  | 15452 | TF | ARRB1  |\n",
       "| ATF1   | 15453 | TF | ATF1   |\n",
       "\n"
      ],
      "text/plain": [
       "  geneName NodeID NodeLabel NodeNames\n",
       "1 AFF4     15448  TF        AFF4     \n",
       "2 AHR      15449  TF        AHR      \n",
       "3 ARID3A   15450  TF        ARID3A   \n",
       "4 ARNT     15451  TF        ARNT     \n",
       "5 ARRB1    15452  TF        ARRB1    \n",
       "6 ATF1     15453  TF        ATF1     "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>261</li>\n",
       "\t<li>4</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 261\n",
       "\\item 4\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 261\n",
       "2. 4\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       "[1] 261   4"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "head(TFName)\n",
    "dim(TFName)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## a data frame of  LncRNA "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "#-----------LncRNA----------------\n",
    "query = \"MATCH (n:LncRNA)\n",
    "        RETURN n.Name AS geneName, id(n) AS NodeID, labels(n) AS NodeLabel, n.Name AS NodeNames\"\n",
    "LncRNAName = unique( cypher(graph, query) )\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "<caption>A data.frame: 6 × 4</caption>\n",
       "<thead>\n",
       "\t<tr><th scope=col>geneName</th><th scope=col>NodeID</th><th scope=col>NodeLabel</th><th scope=col>NodeNames</th></tr>\n",
       "\t<tr><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;int&gt;</th><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;chr&gt;</th></tr>\n",
       "</thead>\n",
       "<tbody>\n",
       "\t<tr><td>ANRASSF1   </td><td>1288086</td><td>LncRNA</td><td>ANRASSF1   </td></tr>\n",
       "\t<tr><td>C5-AS1     </td><td>1288087</td><td>LncRNA</td><td>C5-AS1     </td></tr>\n",
       "\t<tr><td>lincRNA-p21</td><td>1288088</td><td>LncRNA</td><td>lincRNA-p21</td></tr>\n",
       "\t<tr><td>SRA        </td><td>1288089</td><td>LncRNA</td><td>SRA        </td></tr>\n",
       "\t<tr><td>CAT7       </td><td>1288090</td><td>LncRNA</td><td>CAT7       </td></tr>\n",
       "\t<tr><td>ANRIL      </td><td>1288091</td><td>LncRNA</td><td>ANRIL      </td></tr>\n",
       "</tbody>\n",
       "</table>\n"
      ],
      "text/latex": [
       "A data.frame: 6 × 4\n",
       "\\begin{tabular}{r|llll}\n",
       " geneName & NodeID & NodeLabel & NodeNames\\\\\n",
       " <chr> & <int> & <chr> & <chr>\\\\\n",
       "\\hline\n",
       "\t ANRASSF1    & 1288086 & LncRNA & ANRASSF1   \\\\\n",
       "\t C5-AS1      & 1288087 & LncRNA & C5-AS1     \\\\\n",
       "\t lincRNA-p21 & 1288088 & LncRNA & lincRNA-p21\\\\\n",
       "\t SRA         & 1288089 & LncRNA & SRA        \\\\\n",
       "\t CAT7        & 1288090 & LncRNA & CAT7       \\\\\n",
       "\t ANRIL       & 1288091 & LncRNA & ANRIL      \\\\\n",
       "\\end{tabular}\n"
      ],
      "text/markdown": [
       "\n",
       "A data.frame: 6 × 4\n",
       "\n",
       "| geneName &lt;chr&gt; | NodeID &lt;int&gt; | NodeLabel &lt;chr&gt; | NodeNames &lt;chr&gt; |\n",
       "|---|---|---|---|\n",
       "| ANRASSF1    | 1288086 | LncRNA | ANRASSF1    |\n",
       "| C5-AS1      | 1288087 | LncRNA | C5-AS1      |\n",
       "| lincRNA-p21 | 1288088 | LncRNA | lincRNA-p21 |\n",
       "| SRA         | 1288089 | LncRNA | SRA         |\n",
       "| CAT7        | 1288090 | LncRNA | CAT7        |\n",
       "| ANRIL       | 1288091 | LncRNA | ANRIL       |\n",
       "\n"
      ],
      "text/plain": [
       "  geneName    NodeID  NodeLabel NodeNames  \n",
       "1 ANRASSF1    1288086 LncRNA    ANRASSF1   \n",
       "2 C5-AS1      1288087 LncRNA    C5-AS1     \n",
       "3 lincRNA-p21 1288088 LncRNA    lincRNA-p21\n",
       "4 SRA         1288089 LncRNA    SRA        \n",
       "5 CAT7        1288090 LncRNA    CAT7       \n",
       "6 ANRIL       1288091 LncRNA    ANRIL      "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>35</li>\n",
       "\t<li>4</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 35\n",
       "\\item 4\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 35\n",
       "2. 4\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       "[1] 35  4"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "head(LncRNAName)\n",
    "dim(LncRNAName)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## a data frame of  all gene names and TF and LncRNA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Your code contains a unicode char which cannot be displayed in your\n",
      "current locale and R will silently convert it to an escaped form when the\n",
      "R kernel executes this code. This can lead to subtle errors if you use\n",
      "such chars to do comparisons. For more information, please see\n",
      "https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows"
     ]
    }
   ],
   "source": [
    "#------------AllgeneName_TF_LncRNA--------------------------------------\n",
    "AllgeneName_TF_LncRNA = unique( rbind(TFName, LncRNAName, AllgeneName) )\n",
    "#AllgeneName_TF_LncRNA就是整个数据库里面所有的基因名称和TF以及LncRNA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table>\n",
       "<caption>A data.frame: 6 × 4</caption>\n",
       "<thead>\n",
       "\t<tr><th scope=col>geneName</th><th scope=col>NodeID</th><th scope=col>NodeLabel</th><th scope=col>NodeNames</th></tr>\n",
       "\t<tr><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;int&gt;</th><th scope=col>&lt;chr&gt;</th><th scope=col>&lt;chr&gt;</th></tr>\n",
       "</thead>\n",
       "<tbody>\n",
       "\t<tr><td>AFF4  </td><td>15448</td><td>TF</td><td>AFF4  </td></tr>\n",
       "\t<tr><td>AHR   </td><td>15449</td><td>TF</td><td>AHR   </td></tr>\n",
       "\t<tr><td>ARID3A</td><td>15450</td><td>TF</td><td>ARID3A</td></tr>\n",
       "\t<tr><td>ARNT  </td><td>15451</td><td>TF</td><td>ARNT  </td></tr>\n",
       "\t<tr><td>ARRB1 </td><td>15452</td><td>TF</td><td>ARRB1 </td></tr>\n",
       "\t<tr><td>ATF1  </td><td>15453</td><td>TF</td><td>ATF1  </td></tr>\n",
       "</tbody>\n",
       "</table>\n"
      ],
      "text/latex": [
       "A data.frame: 6 × 4\n",
       "\\begin{tabular}{r|llll}\n",
       " geneName & NodeID & NodeLabel & NodeNames\\\\\n",
       " <chr> & <int> & <chr> & <chr>\\\\\n",
       "\\hline\n",
       "\t AFF4   & 15448 & TF & AFF4  \\\\\n",
       "\t AHR    & 15449 & TF & AHR   \\\\\n",
       "\t ARID3A & 15450 & TF & ARID3A\\\\\n",
       "\t ARNT   & 15451 & TF & ARNT  \\\\\n",
       "\t ARRB1  & 15452 & TF & ARRB1 \\\\\n",
       "\t ATF1   & 15453 & TF & ATF1  \\\\\n",
       "\\end{tabular}\n"
      ],
      "text/markdown": [
       "\n",
       "A data.frame: 6 × 4\n",
       "\n",
       "| geneName &lt;chr&gt; | NodeID &lt;int&gt; | NodeLabel &lt;chr&gt; | NodeNames &lt;chr&gt; |\n",
       "|---|---|---|---|\n",
       "| AFF4   | 15448 | TF | AFF4   |\n",
       "| AHR    | 15449 | TF | AHR    |\n",
       "| ARID3A | 15450 | TF | ARID3A |\n",
       "| ARNT   | 15451 | TF | ARNT   |\n",
       "| ARRB1  | 15452 | TF | ARRB1  |\n",
       "| ATF1   | 15453 | TF | ATF1   |\n",
       "\n"
      ],
      "text/plain": [
       "  geneName NodeID NodeLabel NodeNames\n",
       "1 AFF4     15448  TF        AFF4     \n",
       "2 AHR      15449  TF        AHR      \n",
       "3 ARID3A   15450  TF        ARID3A   \n",
       "4 ARNT     15451  TF        ARNT     \n",
       "5 ARRB1    15452  TF        ARRB1    \n",
       "6 ATF1     15453  TF        ATF1     "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>67596</li>\n",
       "\t<li>4</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 67596\n",
       "\\item 4\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 67596\n",
       "2. 4\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       "[1] 67596     4"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "head(AllgeneName_TF_LncRNA)\n",
    "dim(AllgeneName_TF_LncRNA)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>67596</li>\n",
       "\t<li>4</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 67596\n",
       "\\item 4\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 67596\n",
       "2. 4\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       "[1] 67596     4"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "dim(unique(AllgeneName_TF_LncRNA))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# a function `geneMatchIndex` for find out those nodes that genes we want"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The format of geneMatchIndex is:\n",
    "\n",
    "`geneMatchIndex(gene, allGeneNode, FullMatch = 1, by = \"geneName\")`\n",
    "\n",
    ">**`gene`：** a vector, what genes you want to match.  \n",
    ">\n",
    ">**`allGeneNode`:**  `allGeneNode` is data you chose which one as your match. It must is one of `AllgeneName_TF_LncRNA`, `TFName`, `LncRNAName` and `AllgeneName`.  \n",
    ">\n",
    ">**`FullMatch = 1`** : This is as defaults. please set argument `FullMatch = 0` ,if you want use fuzzy match for those gene names contain strings of your input. \n",
    ">\n",
    ">**`by`** : one type of  `\"geneName\"`,  `\"NodeID\"`,   ` \"NodeLabel\"` and  `\"NodeNames\"`, it should be as your genes types.\n",
    "\n",
    "**Results**\n",
    "\n",
    "A list contains `TargetNodes` and `NoGeneIndex`.\n",
    "\n",
    "`TargetNodes` is a frame data of those matched in `allGeneNode`. `NoGeneIndex` is a vector included those didnot find out in `allGeneNode`. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Your code contains a unicode char which cannot be displayed in your\n",
      "current locale and R will silently convert it to an escaped form when the\n",
      "R kernel executes this code. This can lead to subtle errors if you use\n",
      "such chars to do comparisons. For more information, please see\n",
      "https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows"
     ]
    }
   ],
   "source": [
    "#----------------------------------------------------------------------------------------------------------------------\n",
    "#这是一个函数，用来匹配一个list的节点对应的id，基因名称等等\n",
    "\n",
    "#-----------grep或者which---------------------\n",
    "#-----------------------------------------\n",
    "#a function geneMatchIndex for find out those nodes that genes we want\n",
    "#一个函数用来查找gene在所有基因数据框内的对应位置和没有匹配的基因\n",
    "\n",
    "# allGeneNode is you chose which one as your match. It must is one of AllgeneName_TF_LncRNA, TFName, LncRNAName and AllgeneName.\n",
    "\n",
    "#This is as defaults. please set argument `FullMatch = 0` If you want use fuzzy match for those gene names contain strings of your input.\n",
    "#FullMatch默认为1，也就是说默认使用的是完全匹配的方式，找到的基因名称跟输入的是一模一样的\n",
    "#FullMatch如果是其他数字，则用grep的方式查找含有该字符串的基因位置\n",
    "\n",
    "#Result is a list includes a data frame of `TargetNodes` about genes and a vector `NoGeneIndex` about those genes not in GREG.\n",
    "#返回的是两个向量的list，geneIndex是对应基因的位置；NoGeneIndex是该基因在数据库中没有找到\n",
    "\n",
    "#The argument `by` must one of `\"geneName\"`,  `\"NodeID\"` ,   `\"NodeLabel\"` and `\"NodeNames\"`. It means the type of your input data.\n",
    "#第三个参数是指匹配的是哪个类型， 是属于基因名，还是节点id，节点的label和节点名称\n",
    "#第三个参数 即 \"geneName\"  \"NodeID\"    \"NodeLabel\" \"NodeNames\"\n",
    "\n",
    "geneMatchIndex = function(gene, allGeneNode, FullMatch = 1, by = \"geneName\"){\n",
    "  geneIndex = c() \n",
    "  NoGeneIndex =  c()\n",
    "  Ag = allGeneNode[by]\n",
    "  if (FullMatch == 1){\n",
    "    #----------which-----------------\n",
    "    for (i in 1:length(gene) ) {\n",
    "      geneIndex1 = which(Ag == gene[i] )\n",
    "      if (length(geneIndex1) == 0){NoGeneIndex = c(gene[i], NoGeneIndex)}\n",
    "      else{geneIndex = c(geneIndex,geneIndex1)}\n",
    "    }\n",
    "  }\n",
    "  \n",
    "  else{\n",
    "    #----------grep---------------\n",
    "    for (i in 1:length(gene) ) {\n",
    "      geneIndex1 = grep(gene[i],Ag, fixed = TRUE)\n",
    "      if (length(geneIndex1) == 0){NoGeneIndex = c(gene[i], NoGeneIndex)}\n",
    "      else{geneIndex = c(geneIndex,geneIndex1)}\n",
    "    }\n",
    "  }\n",
    "  \n",
    "  TargetNodes <- allGeneNode[geneIndex, ]\n",
    "  geneInGREG = list(TargetNodes, NoGeneIndex)\n",
    "  names(geneInGREG) = c(\"TargetNodes\", \"NoGeneIndex\")\n",
    "  #返回匹配上的TargetNodes和没有找到基因NoGeneIndex\n",
    "  return (geneInGREG )\n",
    "}\n",
    "\n",
    "\n",
    "#--------------geneMatchIndex函数说明--------------------------------------------------------------------------------------------------------\n",
    "#geneMatchIndex(gene, allGeneNode, FullMatch = 1, by = \"geneName\")\n",
    "#gene：你自己选择基因列表，可以使基因对应的节点id，也可以是基因名称，还可以是基因对应节点的Name属性。\n",
    "#allGeneNode #It must is one of AllgeneName_TF_LncRNA, TFName, LncRNAName and AllgeneName.\n",
    "#FullMatch = 1， 直接匹配；\n",
    "#by: 选择对应的类型 \"geneName\"  \"NodeID\"    \"NodeLabel\" \"NodeNames\"\n",
    "\n",
    "#返回匹配上的TargetNodes和没有找到基因NoGeneIndex\n",
    "#----------------------------------------------------------------------------------------------------------------------"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Use cypher command to make modules for chr12\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Make modules for chr12"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\n",
    "// to make louvain modules for chr12\n",
    "CALL algo.louvain.stream(\n",
    "  'MATCH (n:chr12)--(m) with id(n) as chr12,id(m) AS m   MATCH (al) where id(al) = m or  id(al) = chr12 with distinct al As al return id(al) as id',\n",
    "  'MATCH (n:chr12)-[r]-(m) RETURN id(n) AS source, id(m) AS target',\n",
    "  {graph:'cypher',direction: 'both'})\n",
    "YIELD nodeId, community\n",
    "\n",
    "MATCH (n)\n",
    "where id(n) = nodeId\n",
    "\n",
    "with collect (id(n)) AS AllnodeId, 'module'+community AS community, collect(n.Name) AS AllNodeNames\n",
    "RETURN AllnodeId, community, AllNodeNames, size(AllnodeId) AS size_of_allnode\n",
    "\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "mod1 = cypher(graph, query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "'data.frame'"
      ],
      "text/latex": [
       "'data.frame'"
      ],
      "text/markdown": [
       "'data.frame'"
      ],
      "text/plain": [
       "[1] \"data.frame\""
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>'AllnodeId'</li>\n",
       "\t<li>'community'</li>\n",
       "\t<li>'AllNodeNames'</li>\n",
       "\t<li>'size_of_allnode'</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 'AllnodeId'\n",
       "\\item 'community'\n",
       "\\item 'AllNodeNames'\n",
       "\\item 'size\\_of\\_allnode'\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 'AllnodeId'\n",
       "2. 'community'\n",
       "3. 'AllNodeNames'\n",
       "4. 'size_of_allnode'\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       "[1] \"AllnodeId\"       \"community\"       \"AllNodeNames\"    \"size_of_allnode\""
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "class(mod1)\n",
    "names(mod1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`AllnodeId` just is columns of nodes ids in each module. \n",
    "\n",
    "`community` is columns  of modules names.\n",
    "\n",
    "`AllNodeNames` is columns for all nodes those have `Name` properties.\n",
    "\n",
    "`size_of_allnode` is calculated by `AllnodeId`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## How many modules(communities) in mod1?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "50"
      ],
      "text/latex": [
       "50"
      ],
      "text/markdown": [
       "50"
      ],
      "text/plain": [
       "[1] 50"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nrow(mod1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Get all gene names/chr12 names/ TF names in each modules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Your code contains a unicode char which cannot be displayed in your\n",
      "current locale and R will silently convert it to an escaped form when the\n",
      "R kernel executes this code. This can lead to subtle errors if you use\n",
      "such chars to do comparisons. For more information, please see\n",
      "https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows"
     ]
    }
   ],
   "source": [
    "mod2 <- mod1\n",
    "\n",
    "#mod1_match_gene to save all match results.\n",
    "mod1_match_gene <- list() #用来存放每个模块nodeid匹配后对应的gene列表，里面包括\n",
    "for (i in 1:nrow(mod2)){\n",
    "  Mod_nodeId_list = unlist(mod1$AllnodeId[i])\n",
    "  Mod_nodes_list = geneMatchIndex(Mod_nodeId_list, AllgeneName_TF_LncRNA, FullMatch = 1, by = \"NodeID\")\n",
    "  Mod_gene_nodes_list = unique(Mod_nodes_list$TargetNodes) #得到每个模块nodeID匹配后基因的列表,加上一个unique来避免重复\n",
    "  \n",
    "  mod1_match_gene[[i]] <-  Mod_gene_nodes_list #保存匹配后的结果\n",
    "  \n",
    "  #Get all gene , TF and LncRNA names in each modules\n",
    "  mod2$allGeneTFLncRNA[[i]] <- unique(Mod_gene_nodes_list$geneName) #得到每个模块对应的基因数量，加上一个unique来避免重复\n",
    "  mod2$size_of_allGeneTFLncRNA[i] <- length(mod2$allGeneTFLncRNA[[i]])  #统计每个匹配后基因的数量\n",
    "  \n",
    "  #Get all chr12 names in each modules\n",
    "  mod2$allchr12Name[[i]] <- unique(Mod_gene_nodes_list$NodeNames[which(Mod_gene_nodes_list$NodeLabel == 'chr12')]) #获取每个模块里chr12的节点名称,加上一个unique来避免重复\n",
    "  mod2$size_of_allchr12Name[i] <- length(mod2$allchr12Name[[i]]) #统计每个模块匹配后chr12节点的数量\n",
    "  \n",
    "  #Get all TF names in each modules\n",
    "  mod2$AllTF[[i]] <- unique(Mod_gene_nodes_list$NodeNames[which(Mod_gene_nodes_list$NodeLabel == 'TF')]) ##获取每个模块里TF的节点名称,加上一个unique来避免重复\n",
    "  mod2$size_of_AllTF[i] <- length(mod2$AllTF[[i]]) #统计每个模块匹配后TF节点的数量\n",
    "}\n",
    "names(mod1_match_gene) <- mod2$community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<ol class=list-inline>\n",
       "\t<li>'AllnodeId'</li>\n",
       "\t<li>'community'</li>\n",
       "\t<li>'AllNodeNames'</li>\n",
       "\t<li>'size_of_allnode'</li>\n",
       "\t<li>'allGeneTFLncRNA'</li>\n",
       "\t<li>'size_of_allGeneTFLncRNA'</li>\n",
       "\t<li>'allchr12Name'</li>\n",
       "\t<li>'size_of_allchr12Name'</li>\n",
       "\t<li>'AllTF'</li>\n",
       "\t<li>'size_of_AllTF'</li>\n",
       "</ol>\n"
      ],
      "text/latex": [
       "\\begin{enumerate*}\n",
       "\\item 'AllnodeId'\n",
       "\\item 'community'\n",
       "\\item 'AllNodeNames'\n",
       "\\item 'size\\_of\\_allnode'\n",
       "\\item 'allGeneTFLncRNA'\n",
       "\\item 'size\\_of\\_allGeneTFLncRNA'\n",
       "\\item 'allchr12Name'\n",
       "\\item 'size\\_of\\_allchr12Name'\n",
       "\\item 'AllTF'\n",
       "\\item 'size\\_of\\_AllTF'\n",
       "\\end{enumerate*}\n"
      ],
      "text/markdown": [
       "1. 'AllnodeId'\n",
       "2. 'community'\n",
       "3. 'AllNodeNames'\n",
       "4. 'size_of_allnode'\n",
       "5. 'allGeneTFLncRNA'\n",
       "6. 'size_of_allGeneTFLncRNA'\n",
       "7. 'allchr12Name'\n",
       "8. 'size_of_allchr12Name'\n",
       "9. 'AllTF'\n",
       "10. 'size_of_AllTF'\n",
       "\n",
       "\n"
      ],
      "text/plain": [
       " [1] \"AllnodeId\"               \"community\"              \n",
       " [3] \"AllNodeNames\"            \"size_of_allnode\"        \n",
       " [5] \"allGeneTFLncRNA\"         \"size_of_allGeneTFLncRNA\"\n",
       " [7] \"allchr12Name\"            \"size_of_allchr12Name\"   \n",
       " [9] \"AllTF\"                   \"size_of_AllTF\"          "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "names(mod2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "#mod2[1,]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# numbers of genes / chr12 node / all node in each community(module)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Your code contains a unicode char which cannot be displayed in your\n",
      "current locale and R will silently convert it to an escaped form when the\n",
      "R kernel executes this code. This can lead to subtle errors if you use\n",
      "such chars to do comparisons. For more information, please see\n",
      "https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windowsRegistered S3 method overwritten by 'grid':\n",
      "  method     from  \n",
      "  print.path RNeo4j\n"
     ]
    }
   ],
   "source": [
    "#---define the backgroup of plot\n",
    "library(ggplot2)\n",
    "backgroup <-   theme(axis.text.x = element_text(vjust = 0.5, hjust = 1, angle = 90 ),\n",
    "                     plot.title = element_text(face =\"bold\" ,hjust = 0.5),\n",
    "                     panel.grid.major = element_blank(), #删除网格线\n",
    "                     panel.grid.minor = element_blank(), #删除网格线\n",
    "                     panel.background=element_rect(fill='transparent',color =\"gray\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We chose data in the top 10 of `size_of_allGeneTFLncRNA` to plot."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Your code contains a unicode char which cannot be displayed in your\n",
      "current locale and R will silently convert it to an escaped form when the\n",
      "R kernel executes this code. This can lead to subtle errors if you use\n",
      "such chars to do comparisons. For more information, please see\n",
      "https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windows"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAA0gAAANICAMAAADKOT/pAAAAQlBMVEUAAAAAujgzMzNNTU1h\nnP9oaGh8fHyMjIyampqnp6eysrK9vb2+vr7Hx8fQ0NDZ2dnh4eHp6enw8PDy8vL4dm3///+S\nCu3FAAAACXBIWXMAABJ0AAASdAHeZh94AAAgAElEQVR4nO2dDZuyrNZAOY+nr5l3mqnz+P//\n6uu3qFhiyobtWtd9l5UbCFiBaI3JAeBjjHQBADSASAAbgEgAG4BIABuASAAbgEgAG4BIABuA\nSAAbgEgAG4BIABvgLZIxn7p3y4y5fpjGgIc5OZ6dLeile+HrbMzp2yer2URflMGrxmZ2/qTW\nP28x77ymzftrzt6pvHrmbH59y7Yv4UW6FilsK9KPuTmenSvovX3hmZkKjxaef/cvynA4kX6z\naYYn8+OZyutnfpwfXIKEF6lI4PFZCmOu5u7Ox7Vz6ZFpwsrOfzPGY0yaffcvynA4kRwZFrX+\n9Ezl9TNP46xwOURE+iyBCZmzkZz5PC6mE+lyMvV+Hp9ts4V/UYYtRPqEkCLNZXjxGkAWiFQM\ncRfvgu1JWb6ylD/F4cL5N++L3PWB71N5HPG4Wq8XRzmnZqS+l3H3JuBxKudJf9diznS62cNO\n9dS1CTd2rfycTHZrMx0k1hfJfsGR+uDw5PfSHvYUSTxvpyLbP6tw5Uxu1CjWw1GufannC+oo\nw6PM1Vy6ytwigy4hK3rcAHbGsxUxradBMWYa3PGUu1Tlg6aF2w+oIudy/Li5k5qvhEkmwzd7\n8xrj9qcR6Vy/+99p+etXLpn1ev1UdUxwq+O+6oCizi7FYWVD327NXuVuI5HqV5q+PUysL5L9\ngiN1+/Dkq37xXCeRdbu2hav/2yL9WiOSM9cq29mCTsvwaEt4d4q0LoNha1gH2taedsazFTGt\np0ExzIsGHzw1UyrTi3Stp/CP8oD4x1SHSI6k5ithnMmoWpoko6ERKbtXxwxnRyU98+/i7vRX\n3tWvZ3/5X1ZVw1/1+rntq8X2o/wE+qveZ3cQ/9uF/OWDflXGN6+YSWJ9kewXpqnbhyf1nvVh\nT5nEb1X5175w53s+EulsNcgg10Gpf+cKOi3DuUrvu6/MoUjrMmgT6qPtN1zvaWc8WxHTehoU\nw93gjqdmSmW94Xvd479Ksa9d04+Tmq+EqUiDavnbeMXqUxqRym7wdJa/GbDtiUq58716H9dW\np1v3Qj745Ku41sfz3/34br1SxvxUzzkSe7peGKVuH57cqj2f1SAzflddTx+IdDPWeDbOtS/1\ntXvXo/JMy2Dn4hBpXQb2m3haCTqKUr06WxHTehoUw93gjqdmSmW/nFVDfTFXqz6tnrkzqflK\nmIo0eLNPv+XW3WmPkfJ8ppLyfHjXbBfvI6vnv9UL9YdR1ZnKefppMOpm9St1uw368al7xUwS\n60thvzBN3T48OVlpj9/Ic/xCyW2w1DAIGZQ66971qDzTMpS7/X6dJ/3qowymTTN4w+2eXcaz\nFTGtp0Ex5hvc8dTcg+aZWzm3e7R+jtN4WwnTdIdvdvB5KM9akboHDf0LzVHMrf+IHrakXQFv\nE5u8ME39Z/xpPJO2a6dylmEtW7ytiGl5pmXIf8/DtzEnkk8GcyIN9hxn7Kz+RfXkaPBXfWD0\noHnmt5zbfdkHVf5JjdO1qsV+DxGwvUj537V+qjsiHrbkq0acJDatwEnq9hmcdx1ktFM5h7BH\nt9X93C5Dmej15zHpVx9lMN2ne77bc5Kxs/oX1ZOjwT16f/tMObc72bMQ/6TG6VrVYr+HCFgj\nUj8Wu2YQJfdyubWb7fhN7QaJTV5wpd6PTq+mdtOCln1ucMA6CMlGb9RdUGcZujWVlyL5ZDAn\n0mlYmV3GMUztyrndvVsMHKfxthKm6Q6rpTq2iAeXSOWb+X1RieXR4b29LOB31AZdwvbn9ZvF\nhu/qOVdikxcmqQ8OT2aTcIp0Hh+vDkIGpb7ZqyKT8jymB1oLRiSPDGZFmr7hx+u6nIaNFxus\nXd98mP5OSzV4pl6PL6fOl26xYZzUfCVMMxlUy9PEdUZ2ItKleku/2YtKzH7b9cp6QfLanzPJ\n2/Vke4H6/mb5+9de9B0mNnlhkvrg8GS06tsn4RLpbsYXKw1CBqV2rNNf+4XAQRlOZe5/CxYb\nPDKYFcne0854tiKm9XQfLX87Gnz8lKuPWDtnbUbVylC5cRs0vX03XwnTTAbVMlipjICJSM3R\n/HmuEs3ghGxzYs8eaR7N2b+s76SDk26DkWtwGtKR2OSFSerDi9yG5yH7JFwiNQdbc/38xflS\nqzzTMjQVWE20XorkkcGsSPaedsazFTGtp/EJ2TyfNPj4KVcfsXYuK/ba5lIdg967E7LjpOYr\nwZGJXS0/kV1sNxGp+kw7f78a1u1LhAZXotRPVdejZNNLhC73fLBfRX3FSPPcNLHJC5PUR2dw\nfuvSj5NwiZS9EWlQ6uEVPPYFNpMyVEW4V2f0X4u0PIN5kew9rYxnK2JaT4NiLBPJ1UfsB5dm\n2lUe7DybF2/u1F9UgiMT683GeImQPJGdXINt6E+aXjf/1sM5rgsbhEUy9eHjbXDdGmjh2p1d\n+N16/HjaFxzGgKxIX+3kigFJH9UBW/vA64t9C0j/i33bci8nyN1kHTSRmezaDUN/G39WnieX\nXAoTxzESQOIgEsAGIBLABiASwAYgEsAGIBLABiASwAYgEsAGIBLABmwl0v8B+LFRz4uEzUTa\nKB04Csp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6\nDCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6\nDCKBDMp6DCKBDMp6DCKpo/lTkabeyk2kPxSlrMcgkjZM06im3jKx/uSash6DSNpozDE5IoUE\nkdTR/M3wZguRwoBI2jDjQSnSgyRlPQaRtDESiREpDIikDtNIxKpdSBAJZFDWYxAJZFDWYxAJ\nZFDWYxBJH/8OkS7ODMp6DCLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAk\nARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLp\nA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIA\niKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSB\nSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE\n0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAk\nARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLp\nA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIA\niKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSB\nSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkwFuRsop2o7nPrfsaZdWSNIgkwLIRKWv+t3dZf9+g\nrFqSBpEEWCSSLQ0iRQ8iCbBYpMzaRqSoQSQBlojUHRJ1Qg1E+qdEWbUkDSIJsFyk5oYRKXoQ\nSYDFIrVbiBQ9iCTAApGywSYiRQ8iCbBYJKZ2yYBIAniJ5F5sqFBWLUmDSAIsn9qNr2jgyoZY\nQSQBuNZOH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gk\nACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9\nIJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIA\nkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4Q\nSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI\n+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gk\nACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9\nIJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIA\nkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4Q\nSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI\n+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gk\nACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9\nIJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIA\nkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4Q\nSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI\n+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gk\nACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9\nIJIAiKQPRBIAkfSRvkjfWbBibAUi6SN9kcxW3TIciKQPRBIAkfSRvEim4GlO5WZ5V2h1MedH\n9fBqzPUZpoB+IJI+VIiU38y92PwxX8XDQh+Tlf5k5UunUEX04b1IWUlznzvuaxApHpIXqZra\n/ZlzsXUxv8Wj8zM/m1uef5U3N/MdqoweLBDJusum9w2IFA86RCoc+iu2svJRsfEoB6JT1V3N\nJUwJvUAkfSgR6a8Q5m6u7dJDeWsawpTQi7dlyux7REoBJSIV48+jOlBSIlJ7iJTnMyL9U4JI\n8aBFpLu5ZaZ69Cindud2ahcly0Ykh0CMSNGiRaTCm2rBobx9ns1Xuc5wKxfyzkEK6McyxREp\nJTSIVPWsuzE/1aOzqZ95Vsvf5dpDdCCSPtIX6bsWqZ7Ulbdnc61OyD6uhVW/AUrnDVM7faQv\nUsNvfe41ysWFMYtEer3YUIFI8aBGpHN1cYMSkWavaODKhlhRIpIxzaqCEpGWgUjxoESkrL2C\nAZFABCUipQUi6QORBEAkfSCSAIikD0QSYCTS+boyHWXVkjSIJMBIpGztCKWsWpIGkQQYifN3\nvj1WpaOsWpIGkQQYiWTMyq98KKuWpEEkARBJH+mL9O88/wtWQD9YtdMHIgmASPpAJAEmIn1f\nimnd2furU4gUD4gkwEik56k6PjLG98tTiBQPiCTASKSruZUX2/p/LR6R4gGRBJis2vX/vUCk\neEAkARBJH4gkgHtqdzO+19whUjwgkgDjxYb6945M5nuhECLFw4FEMu3t3Awq2JdrJxl9nYw5\n3bz/BA0ixcNxRDJ1/41SpJUgUjwgkr1HIBBJHwcVqTz92fzcfnefG+vxroxzeN7Kqd0XU7uE\nOYxIpv/frjS3g1Nzb6zH+zLK4MFiQ/ocVaQ8f3m/L+Ovmld/9PZx9v6jaIgUD0cRyV6yeyVS\nkD+p5Dghm5d/S5oTsulyGJFaRRaMSLszyuVi6qMjRqSEOYxI7W2EIuWXemrn/eduESkeDiKS\n6e7nRZJZbDA2nukgUjwcXCT55W9E0sFBRIoLTsjqA5EEQCR9IJIAiKQPRBJg/DWKK8dIyYNI\nAkzOIyFS8iCSAJMrG37WpYNI8ZC+SP97QbAC+jES6bT2mAmR4iF9kRJkfPX3ii/HViirlqRJ\nX6T0R6T8h2Ok5ElfpP/Mk4hILDYoAJEEYLFBH4gkwGREWpkOIsUDIgkw+RrFlT99mTqIJMBk\nascxUvIgkgCIpA9EEoCLVvWBSAIgkj4QSQCmdvo4mkjjvtr8KIppfzHStc/mIJI+Di6S6X/t\npP391fAi1TzOX77pIFI8HFuk/vfAm59EEfml1Yan8TUJkeLhMCJ1s7f+vnq632Eg0nD30S/u\nf8pMIkztEuYoIg1mb/0sbiyS9fPg1u6jJz/GncaPyTzTQaR4OJRIuWXI6HnbIOs1M4nZQaRu\nreHmmQ4ixQMiWRuDkceYiUhb/cK+W6TM1yNEighEGj7fHihNZnNmm8FokOmnIFI8IJJ114s0\nnc0hErziUCKNDckHBvVnZ9uFuxDHSPz2tw6OItLg4oWxSG0vtnxqflR/INIuy9+IpIPDiBQT\nTmG+TOb7jXNEigdEEsAh0uNU/SFZPxApHhBJgKlI38Z8+6eDSPGASAKMRXqcVwxHOSLFBCIJ\nMBJp3XCUI1JMIJIAA5GK4ei07keEECki0hcp8Z8s/sm8vz3RgUjxkL5ICcJ5JH2kL9J/50lh\nREIkHSCSAFxrpw9EEgCR9IFIAiCSPhBJAETSByIJgEj6QCQBEEkfiCQAIukDkQRAJH0gkgCI\npI/jiLTg0gHrEgPrUgMz2/GtCxKmP6LyKp83ry8FkeLhMCIt6eLGueMLkfp7+/f35wNGcZ+C\nSPFwFJEmPwjpwExum60lIk1+Ge9tRp+DSPFwNJGq7eHv6ef9HG5822z1wgwjEAlaDihS94tc\n419TfS/SKGIgUpeEyd+pgkj6OJRIw9/zdt53ItmrCMMfwbPFsndDpCNzKJHyZiQaCTX9eUir\nr78Uabi/sV586Qoi6eOIItlPjR/7izQ+OFrwHT1E0gcibS7SMN4FIunjKCINZ2CuYySHHblt\nyVzkYKFinIwbRNLHYUSyrmwY/Z5+PjhEcorUXu4wjHAMc4h0VI4jUkQgkj4QSQBE0gciCYBI\n+kAkARBJH4gkACLpA5EEQCR9pC9S4j+i/wmIFA/pi5QgiKQPRBIAkfSBSAIgkj4QSQBE0gci\nCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0kdQkeofOhjeLEJZ\nj0EkfYQUyXQ/WNXfLENZj0EkfQSe2o1+/g2RPkJZtSRNWJGsH4Szf87qLcp6DCLpQ2BEan4Y\nLkekT1FWLUkT/BipdcnjCEldj0EkfQRftWt+1rTbWoSyHoNI+uA8kgCIpA9EEgCR9IFIAiCS\nPsKKtDY3ZT0GkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIA\nkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4Q\nSQBE0gciCYBI+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI\n+kAkARBJH4gkACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gk\nACLpA5EEQCR9IJIAiKQPRBIAkfSBSAIgkj4QSQBE0gciCYBI+kAkARBJH4gkQOIiGVPdVLf1\nEzLliApEEiBtkUz7r1GquT04iCRA2iLl5RswjUP1A6lyRAQiCZC6SP2YZI1OBweRBFAgUt6L\nZAxzO0QSIXGR+qFI4WKD6d5S9fmw+DMCkQRIWyRj9TB1IrUfEIOp6xIQSYD3bZMVtPfZ6HG/\nl7JqiQRTr58Y4/UpgUgCvG2brL3Jho+752uUVUscmE4la/L6HkQSAJEixlo/QaTIWdY4We9M\nbCKF7TVBMe2d58o+IgmwXKT2EKl9nLcP/inpqsUY+2b/9Wi9Ipn+TLNfVSKSAIvaxiXQzIjU\nz+m7a3c2LK0DvSKtBpEEWCxSu/F+atfoY0wIjxBpCiIJsKSfZ/bWW5G66YjfEfJaEGkCIgmw\noJ9n/e1ikfyPkNeiWaSV7w2RBFhwQra/cy82VPSLDfng5AcifQAipcP780hzVzS4r2ywLtox\nIWZ2iLRZ2EoQqSLta+1yRNoubCWIVIFIEYNI6YBIEYNI6bCDSGF7NiJtFbYSRKpApIhBpHRA\npIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRA\npIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRA\npIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRApIhBpHRA\npIhBpHRApIhBpHRApBCY6d8EXQIipQMiBcAM/tL78j9RjUjpgEghMM1NLRIjUgkiOUGkVwxF\nYkQqQSQniPQKk7cyGURqQCQniPQK0/9HpAZEcoJIr7BGpJxVuxpEcnIMkToN/IRYCyKlAyJ5\nYAbrBcunaGtBpHRAJB/qE6vexzprQaR0QCQf1o5IYY1AJAEQyQfT/TPtzSIQaQoiOTmWSIxI\nn+eGSE4OI9KqVTtEmoJITo4h0loQaQoiOUGkVyDSFERygkivQKQpiOTkICIlYUQSVYJIbhAp\n+bCVIFIFIoXILYmwlSBSBSKFyC2JsJUgUsVBRapPA3VfE9J1QgiRBDimSJ1C/QXdO+aWSNhK\nEKnimCLl/ZVyiPQhiFRxYJGsb38j0noQqeK4IuWItAmIVHFckRiRtgGRKo4rUt4fI7Fq9wGI\nVHFQkQLnlkTYShCpApFC5JZE2EoQqQKRQuSWRNhKEKniqCIRthWIVIFIhH0GIlUgEmGfgUgV\niETYZyBSBSIR9hmIVIFIhH0GIlUgEmGfgUgV0Yik+rcXkwhr6936++s75oZIbj4VafVfTEmi\nj6YQZn/FMcCfFUQkN5uMSFUL8p1VobCVXy1BpIq4RLL+2sPSuCT6aBJhZnDD1M6POEViRBII\n6x3KGZG8iUqkrgURSSCs/0GYHJG8iUkka7mIqV34sL4FqkdM7byIRqS1JNFHkwhbCSJVIBJh\nn4FIFYhE2GcgUkU8IiXR2QjbKgyR3CASYX7tjUhOEIkwv/ZGJCeIRJhfeyOSE0QizK+9EckJ\nIhHm196I5ASRCPNrb0RygkiE+bU3IjlBJML82huRnCASYX7tjUhOEIkwv/ZGJCeIRJhfeyOS\nE0QizK+9EckJIhHm196I5ASRCPNrb0RygkiE+bU3IjlBJML82huRnCBSKmGzvwsdtpCI5AaR\nEgmb/13osIVEJDeIlEgYIu0DIh0sDJH2AZGOFlb+BiQibQ4iHSyMEWkfEOloYc3fEmtuxAqJ\nSG4QiTC/9kYkJ4hEmF97I5ITRCLMr70RyQkipRL23wFihUQkN4iUShgi7QIiHS0MkXYBkY4W\nhki7gEhHC0OkXUCko4Uh0i4g0tHCEGkXEOloYYi0C4h0tDBE2gVEOloYIu0CIh0tDJF2AZGO\nFoZIu4BIRwtDpF1ApKOFIdIuINLRwhBpFxDpaGGItAuIdLQwRNoFRDpaGCLtAiIdLQyRdgGR\njhaGSLuASEcLQ6RdQKSjhSHSLiDS0cIQaRcQ6WhhiLQLiHS0METaBUQ6Whgi7QIiHS0MkXYB\nkY4Whki7gEhHC0OkXUCko4Uh0i4g0tHCEGkXEOloYYi0C4h0tLCwItV/p9Z0Wz2I5ASRUgkL\nKlL9l9ONabcsEMkJIqUSFnpqZ/JGJkakJSBStGGmnViZqjMHFqmd2jEiLQORYg2rerDpe7TU\niIRIi0CkiMNMO7EqbwSOkRBpOYgUb5ixOzSrdvuASPrDzGBI4DzSLiCS+rDR3AqRdgGRtIfV\na3Wmndkh0j4g0tHCwor039nsEMkJIqUShki7gEhHC0OkXUCkdMO6ReXRyvIo7D9DEGkXtIu0\nsLPJFnJdWHcp6Phc5ygMkUIQXCSrUwfo2ks72za5BQ5raxGRIiC0SNYV9UHGCEtZnSI5rr4Z\nhSFSCCRGJGuUyOfCHO3omqEt7mxBxr/2AmvfQq7Mzbr6JoRI1Xszk69DvA5DJE+8RZpcxPi2\nHZ1Ry0XyHJH67x14ha0q5MrcTP8/0Ijk+ERCpBo5kcb95l07mjXtuLSzbZRb7pR2x/fmHAFH\nYduJ5CqjO6zbE5E88Z/aeU+2zPJ2HGa3oLM5MluTW+7T2bbIzckoTECkfhaOSJ54ibRq1W7x\np7b7WCp/F+bMzbtrOwek3XJb9N42E8npkSvM9MfAiOTJG5He9etJ2L9t4brIpcdIM/utyW1h\nr7HfnkdnW5Xbipr8QKTh9Hvpe7NbAJE8eS3S2349CWuHFity+aqdu8W9clvctceFzJetGqzM\nzd5tqRGfjUhrROpAJG/2EGlmnrQsrLqZb8a3ufXfO9itkJMPicVh+fTNzYd9JNKqmQSLDetZ\nKpJ/1/Y/2Om7drDcVoWtnH8iUowEO0ZaLZL/HC3v+ltYbX3D1ohknXwNIdKC7uEK60EkT/Ya\nkfyNsFe7vUV6Vx1bFTKVEakvn1dYPhOGSG9Zumrn37X9jejx7trmzcmP7Qpp+sHFr2t3LYZI\nMbFepKygf7T0PFIIIxIL26aPzodtcx5pk9wQaUrW3VQgEiK9zw2RpkQq0tJm3MMIRHqXGyJN\nWSrS4ordxogEwxZ37fTDEGlKL9I/JcqqBXZHWY/ZYUQCWICyHoNIIIOyHoNIIIOyHoNIIIOy\nHoNIIIOyHrPDlQ0AC1DWY3a41g5gAcp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6\nDCKBDMp6DCKBDMp6DCKBDKBpt4MAAAcLSURBVMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6\nDCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6DCKBDMp6\nDCKBDMp6DCKBDMp6zGYiveOft3sQpihsQdxGPS8SthLpLf8QdqSw1XGpgkiE7RGGSHuRRPMT\ntlUYIu1FEs1P2FZhiAQA/iASwAYgEsAGIBLABoQRKWsJllu94R+2tpC+QVmXo2dcyEKurcnP\nSpkmQUTKHFs751a1oVdu2fBmcVi26lOiK55/WNhCrqjJtaVMmphF+qT5q7sQfTRf9ZHdixR7\nIXP/mkSkvVg7Iq1rhqy7D9JH1/WYwCKtL2R9j0jviFqkde3QBa0ayFbkmnl/ZFej7WqR/MPy\nlYW0g33jEGkHQi82tBtrwtYU0vcju8ko888tbCFX1iSLDbCSJLpMEoVMFUQC2IBgImVrJung\nYGVNrm+AdUEHa+9QImX2QhV8wMqaXBO28vzD2uySJmaR1p5HUhyWBxVp5emn1dmlTMwirW0G\nzWFhRVq/ho1IO/FBO67KTG1YWJFWnX76ILt0CbnYcKjzCvuxsibXNsCqc2THa2+Wv+ENR9Jh\nPYgEsAFhrrX7YBk16EmT6MOCrxGuem8fZJcskY9IgY+sUwgLSxKFjAFESi0sLEkUMgaCLX/H\nf/YxlbCVNRm0AdZmly5hRyT/9kiiawuMSKFOXn02Ih3Ho9BTu5WfbP75KA5rggOFfTawHMek\n2EWCGdIYI47T3oiUKIgUF4EXG9bEBDppkkRYvq4mV4Z9dvrpUGsNsS9/A6QBIgFsQOSXCBHm\njgk9kQw2JUyWcF+j6G5WxhJmRwQL62PDZZciAb/YZ92tjCYsX12TgRvgs+wSBJFSC0OkKEGk\n1MIQKUoi/6p52LMYSYSFvSBp9ZrBwdYaWP4G2AJEAtiAmKd2YU+aJBHWh/pGBWyAtdklTeyL\nDWFPmqQQFnix4ZP3xmLD9oRtfsKEwxBpL5JofsK2CkOkvUii+QnbKgyRdiOFkyaEbRbGYgMA\n+INIABsQeGoX8UmTxMLCXsjkG/XBtUWJEnixYWVY3EfWImG+hG2AA60yNCBSomG+INK+IFKi\nYb4g0r6E/ar52qgkunbgUzRhwlafDzqaSSw2JBrGYkNcRD61gwlhp3ZrOVx7I1JqIFKUxC6S\nxDwm7rDAIq19byuzS5Y0FhsIk8putRBHMyn+v9i3KjfNYStrMmgD8Bf7IiONrh00LCxJFDIG\nIhcpjb6NSRC9SAkc/of+YbugJFHICIhcpCSGCAYkQKTkwsKSRCFjAJFSCwtLEoWMgchFSqNv\nYxJELlLgkyYphIUliULGQOQiAaQBIgFsACIBbAAiAWwAIgFsACIBbAAiAWwAIgFsACJtjSmq\n9Ht8AvN+zbPL96PafnxfHOc3jZl/1HK9b1NE2B5E2prSgbEHv1n5nLlWD67GpckSkfLsd5sy\nwuYg0h6MPci+y+dO9UCUnVaLNBnpIBYQacjjYrJbtVEMHNdyLlb06Yu55I+TuTwdj/J2DGoj\ni0fFkGOe5lS+Vt3dsur5L1MOKL/FvbEzyB/nIsV+IOu2nuUez/Kpr8ycvsuNumwQH4g04JmV\nElzajayS5VJs/Zzqqdn4URlU9/wq4NaJlN9MeUTzY74KmWrBCoWK+0KnMqDPoNq6OESq9ih1\nvJUb5rvaekpVDbwEkQbcCj2qfn4z5zw/12JcCx2KrZ+6hw8flUH11vmZf5us9+CvTKEYvn4L\nde71XllpxcnkwwzKred5KtJX/WI1K3wUpSqHtXvlIsQHIg04tZ/4p6Lv5o9yPCh7cXHz7KZw\ng0flvt3z3XPV8xfzV2xl5Ubz2rXYeBQmli/3GTRbE5FO9aNLOTS163WP8iFECCIN6A7yR7Os\n7sbxyLFVPforOv19MAG8F8PLt/l5GWonUlOMQ8Uk7/QYFhDignYZsKVI5VBTHSh1rz2LSdy5\nGM18RSqkPJl66RuRIoV2GeCc2uWvRXLMyupHd3PLut2r28Ki8tDo5dSu2zoN2ua7TwUihHYZ\ncCsO8P/Giw35rEhZMU9zrRM03f1kmgWH9vjp21zK1YJhBl/lOsV5mlxZlvyn3C0zv0WpysUG\njpFiBZEGPNolZ3v5O58VqVqX/nKJVJ05vZvCjLxftStHm2oFwriXv4fJ1XuU+9fL3185q3bx\ngkhD/s7NaVL7hOysSHkxd/tyHN581yI1a3nteaS8HFuydtM6IXtpTsiOkiv3OFdHRsXzWWUQ\n55FiBZF25Le+uqHo/lulaLiyIVIQaUfOpjn9k31vkyDX2kULIu2GqZcaSn43EoCrv6MFkXYj\ns1bY7tctUuT7SPGCSAAbgEgAG4BIABuASAAbgEgAG4BIABuASAAbgEgAG/D/de98DyH7x2QA\nAAAASUVORK5CYII=",
      "text/plain": [
       "plot without title"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "mod2 <- mod2[order(-mod2[,'size_of_allGeneTFLncRNA']),]\n",
    "number_gene = mod2[,c('community','size_of_allGeneTFLncRNA')][1:10,]\n",
    "number_gene$type = rep('Gene/TF/LncRNA', nrow(number_gene))\n",
    "names(number_gene)[2] = 'count' \n",
    "\n",
    "number_chr12node = mod2[,c('community','size_of_allchr12Name')][1:10,]\n",
    "number_chr12node$type = rep('chr12Name', nrow(number_chr12node))\n",
    "names(number_chr12node)[2] = 'count'\n",
    "\n",
    "number_AllNode = mod2[,c('community','size_of_allnode')][1:10,]\n",
    "number_AllNode$type = rep('Allnode', nrow(number_AllNode))\n",
    "names(number_AllNode)[2] = 'count'\n",
    "\n",
    "number_gene_chr12node_AllNode = rbind(number_gene,number_chr12node,number_AllNode)\n",
    "\n",
    "library(ggplot2)\n",
    "ggplot(number_gene_chr12node_AllNode, aes(x = community, y = count,fill = type)) +\n",
    "  geom_bar(stat=\"identity\", position = 'dodge',width=0.8)+  ##identity意味着把y当做值去输入，如果改成bin，就会计算y出现的频数。dodge意味是各组是左右分布而不是上下重叠\n",
    "  labs(x=\"community(Modules)\",y = \"Number\")+\n",
    "  ggtitle(\"numbers of genes / chr12 node / all node in each community(module)\", ) + backgroup+\n",
    "  geom_text(aes(x = number_gene_chr12node_AllNode$community, \n",
    "                y = number_gene_chr12node_AllNode$count,\n",
    "                group = number_gene_chr12node_AllNode$type, \n",
    "                label=number_gene_chr12node_AllNode$count), position=position_dodge(0.8),hjust=0.5, size = 2, vjust = -0.5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "save(AllgeneName,TFName,LncRNAName,AllgeneName_TF_LncRNA, mod1,mod2, file = \"moduleForchr12.RData\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "R",
   "language": "R",
   "name": "ir"
  },
  "language_info": {
   "codemirror_mode": "r",
   "file_extension": ".r",
   "mimetype": "text/x-r-source",
   "name": "R",
   "pygments_lexer": "r",
   "version": "3.6.1"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
